Show / Hide Table of Contents
Enum WeldEvaluation
WeldEvaluation
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum WeldEvaluation
Fields
 Name |  Description
 ApplyPlasticWelds
Plasticity in welds is taken into account in AM
 ForceResultant
Check is calculated as resultant of all forces in weld
 MaxForceElement
Check is calculated in element with max force in weld (too conservative)
 Improve this Doc
 View Source